A Sloped Glazing with no slope is not allowed.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId NoFlatCurtainRoofs { get; }
  Visual Basic
Public Shared ReadOnly Property NoFlatCurtainRoofs As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ NoFlatCurtainRoofs {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures RoofFailures Class
  Autodesk.Revit.DB Namespace